cyliangtw/hal_nuvoton/dts/pinctrl/m031-pinctrl.h
/*
 * Copyright (c) 2026 Nuvoton Technology Corporation.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include "../m031x/sys_reg.h"
#include "../m031x/sys.h"

#define NVT_PINMUX(port, pinIndex, mfp) \
    ((((port) - 'A') << 28) | \
    ((pinIndex) << 24) | \
    ((mfp) >> ((pinIndex % 8) * 4)))

#define PA0MFP_GPIO                  NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_GPIO)
#define PA0MFP_QSPI0_MOSI0           NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_QSPI0_MOSI0)
#define PA0MFP_SPI0_MOSI             NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_SPI0_MOSI)
#define PA0MFP_UART0_RXD             NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_UART0_RXD)
#define PA0MFP_UART1_nRTS            NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_UART1_nRTS)
#define PA0MFP_BPWM0_CH0             NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_BPWM0_CH0)
#define PA0MFP_PWM0_CH5              NVT_PINMUX('A', 0, SYS_GPA_MFPL_PA0MFP_PWM0_CH5)
#define PA1MFP_GPIO                  NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_GPIO)
#define PA1MFP_QSPI0_MISO0           NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_QSPI0_MISO0)
#define PA1MFP_SPI0_MISO             NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_SPI0_MISO)
#define PA1MFP_UART0_TXD             NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_UART0_TXD)
#define PA1MFP_UART1_nCTS            NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_UART1_nCTS)
#define PA1MFP_USCI1_CLK             NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_USCI1_CLK)
#define PA1MFP_BPWM0_CH1             NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_BPWM0_CH1)
#define PA1MFP_PWM0_CH4              NVT_PINMUX('A', 1, SYS_GPA_MFPL_PA1MFP_PWM0_CH4)
#define PA2MFP_GPIO                  NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_GPIO)
#define PA2MFP_QSPI0_CLK             NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_QSPI0_CLK)
#define PA2MFP_SPI0_CLK              NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_SPI0_CLK)
#define PA2MFP_UART4_RXD             NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_UART4_RXD)
#define PA2MFP_I2C0_SMBSUS           NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_I2C0_SMBSUS)
#define PA2MFP_UART1_RXD             NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_UART1_RXD)
#define PA2MFP_I2C1_SDA              NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_I2C1_SDA)
#define PA2MFP_USCI1_DAT0            NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_USCI1_DAT0)
#define PA2MFP_BPWM0_CH2             NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_BPWM0_CH2)
#define PA2MFP_PWM0_CH3              NVT_PINMUX('A', 2, SYS_GPA_MFPL_PA2MFP_PWM0_CH3)
#define PA3MFP_GPIO                  NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_GPIO)
#define PA3MFP_QSPI0_SS              NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_QSPI0_SS)
#define PA3MFP_SPI0_SS               NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_SPI0_SS)
#define PA3MFP_UART4_TXD             NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_UART4_TXD)
#define PA3MFP_I2C0_SMBAL            NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_I2C0_SMBAL)
#define PA3MFP_UART1_TXD             NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_UART1_TXD)
#define PA3MFP_I2C1_SCL              NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_I2C1_SCL)
#define PA3MFP_USCI1_DAT1            NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_USCI1_DAT1)
#define PA3MFP_BPWM0_CH3             NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_BPWM0_CH3)
#define PA3MFP_PWM0_CH2              NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_PWM0_CH2)
#define PA3MFP_CLKO                  NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_CLKO)
#define PA3MFP_PWM1_BRAKE1           NVT_PINMUX('A', 3, SYS_GPA_MFPL_PA3MFP_PWM1_BRAKE1)
#define PA4MFP_GPIO                  NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_GPIO)
#define PA4MFP_QSPI0_MOSI1           NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_QSPI0_MOSI1)
#define PA4MFP_SPI0_I2SMCLK          NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_SPI0_I2SMCLK)
#define PA4MFP_UART0_nRTS            NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_UART0_nRTS)
#define PA4MFP_UART0_RXD             NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_UART0_RXD)
#define PA4MFP_I2C0_SDA              NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_I2C0_SDA)
#define PA4MFP_UART5_RXD             NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_UART5_RXD)
#define PA4MFP_BPWM0_CH4             NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_BPWM0_CH4)
#define PA4MFP_PWM0_CH1              NVT_PINMUX('A', 4, SYS_GPA_MFPL_PA4MFP_PWM0_CH1)
#define PA5MFP_GPIO                  NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_GPIO)
#define PA5MFP_QSPI0_MISO1           NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_QSPI0_MISO1)
#define PA5MFP_UART0_nCTS            NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_UART0_nCTS)
#define PA5MFP_UART0_TXD             NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_UART0_TXD)
#define PA5MFP_I2C0_SCL              NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_I2C0_SCL)
#define PA5MFP_UART5_TXD             NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_UART5_TXD)
#define PA5MFP_BPWM0_CH5             NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_BPWM0_CH5)
#define PA5MFP_PWM0_CH0              NVT_PINMUX('A', 5, SYS_GPA_MFPL_PA5MFP_PWM0_CH0)
#define PA6MFP_GPIO                  NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_GPIO)
#define PA6MFP_EBI_AD6               NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_EBI_AD6)
#define PA6MFP_UART0_RXD             NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_UART0_RXD)
#define PA6MFP_I2C1_SDA              NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_I2C1_SDA)
#define PA6MFP_PWM1_CH5              NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_PWM1_CH5)
#define PA6MFP_BPWM1_CH3             NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_BPWM1_CH3)
#define PA6MFP_ACMP1_WLAT            NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_ACMP1_WLAT)
#define PA6MFP_TM3                   NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_TM3)
#define PA6MFP_INT0                  NVT_PINMUX('A', 6, SYS_GPA_MFPL_PA6MFP_INT0)
#define PA7MFP_GPIO                  NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_GPIO)
#define PA7MFP_EBI_AD7               NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_EBI_AD7)
#define PA7MFP_UART0_TXD             NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_UART0_TXD)
#define PA7MFP_I2C1_SCL              NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_I2C1_SCL)
#define PA7MFP_PWM1_CH4              NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_PWM1_CH4)
#define PA7MFP_BPWM1_CH2             NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_BPWM1_CH2)
#define PA7MFP_ACMP0_WLAT            NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_ACMP0_WLAT)
#define PA7MFP_TM2                   NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_TM2)
#define PA7MFP_INT1                  NVT_PINMUX('A', 7, SYS_GPA_MFPL_PA7MFP_INT1)
#define PA8MFP_GPIO                  NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_GPIO)
#define PA8MFP_EBI_ALE               NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_EBI_ALE)
#define PA8MFP_USCI0_CTL1            NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_USCI0_CTL1)
#define PA8MFP_UART1_RXD             NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_UART1_RXD)
#define PA8MFP_UART7_RXD             NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_UART7_RXD)
#define PA8MFP_BPWM0_CH3             NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_BPWM0_CH3)
#define PA8MFP_TM3_EXT               NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_TM3_EXT)
#define PA8MFP_INT4                  NVT_PINMUX('A', 8, SYS_GPA_MFPH_PA8MFP_INT4)
#define PA9MFP_GPIO                  NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_GPIO)
#define PA9MFP_EBI_MCLK              NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_EBI_MCLK)
#define PA9MFP_USCI0_DAT1            NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_USCI0_DAT1)
#define PA9MFP_UART1_TXD             NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_UART1_TXD)
#define PA9MFP_UART7_TXD             NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_UART7_TXD)
#define PA9MFP_BPWM0_CH2             NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_BPWM0_CH2)
#define PA9MFP_TM2_EXT               NVT_PINMUX('A', 9, SYS_GPA_MFPH_PA9MFP_TM2_EXT)
#define PA10MFP_GPIO                 NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_GPIO)
#define PA10MFP_ACMP1_P0             NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_ACMP1_P0)
#define PA10MFP_EBI_nWR              NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_EBI_nWR)
#define PA10MFP_USCI0_DAT0           NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_USCI0_DAT0)
#define PA10MFP_UART6_RXD            NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_UART6_RXD)
#define PA10MFP_BPWM0_CH1            NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_BPWM0_CH1)
#define PA10MFP_TM1_EXT              NVT_PINMUX('A', 10, SYS_GPA_MFPH_PA10MFP_TM1_EXT)
#define PA11MFP_GPIO                 NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_GPIO)
#define PA11MFP_ACMP0_P0             NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_ACMP0_P0)
#define PA11MFP_EBI_nRD              NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_EBI_nRD)
#define PA11MFP_USCI0_CLK            NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_USCI0_CLK)
#define PA11MFP_UART6_TXD            NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_UART6_TXD)
#define PA11MFP_BPWM0_CH0            NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_BPWM0_CH0)
#define PA11MFP_TM0_EXT              NVT_PINMUX('A', 11, SYS_GPA_MFPH_PA11MFP_TM0_EXT)
#define PA12MFP_GPIO                 NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_GPIO)
#define PA12MFP_UART4_TXD            NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_UART4_TXD)
#define PA12MFP_I2C1_SCL             NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_I2C1_SCL)
#define PA12MFP_BPWM1_CH2            NVT_PINMUX('A', 12, SYS_GPA_MFPH_PA12MFP_BPWM1_CH2)
#define PA13MFP_GPIO                 NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_GPIO)
#define PA13MFP_UART4_RXD            NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_UART4_RXD)
#define PA13MFP_I2C1_SDA             NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_I2C1_SDA)
#define PA13MFP_BPWM1_CH3            NVT_PINMUX('A', 13, SYS_GPA_MFPH_PA13MFP_BPWM1_CH3)
#define PA14MFP_GPIO                 NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_GPIO)
#define PA14MFP_UART0_TXD            NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_UART0_TXD)
#define PA14MFP_BPWM1_CH4            NVT_PINMUX('A', 14, SYS_GPA_MFPH_PA14MFP_BPWM1_CH4)
#define PA15MFP_GPIO                 NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_GPIO)
#define PA15MFP_UART0_RXD            NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_UART0_RXD)
#define PA15MFP_BPWM1_CH5            NVT_PINMUX('A', 15, SYS_GPA_MFPH_PA15MFP_BPWM1_CH5)
#define PB0MFP_GPIO                  NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_GPIO)
#define PB0MFP_ADC_CH0               NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_ADC_CH0)
#define PB0MFP_ADC0_CH0              NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_ADC0_CH0)
#define PB0MFP_EBI_ADR9              NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_EBI_ADR9)
#define PB0MFP_UART2_RXD             NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_UART2_RXD)
#define PB0MFP_SPI0_I2SMCLK          NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_SPI0_I2SMCLK)
#define PB0MFP_I2C1_SDA              NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_I2C1_SDA)
#define PB0MFP_QSPI0_MOSI1           NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_QSPI0_MOSI1)
#define PB0MFP_PWM0_CH5              NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_PWM0_CH5)
#define PB0MFP_PWM1_CH5              NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_PWM1_CH5)
#define PB0MFP_PWM0_BRAKE1           NVT_PINMUX('B', 0, SYS_GPB_MFPL_PB0MFP_PWM0_BRAKE1)
#define PB1MFP_GPIO                  NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_GPIO)
#define PB1MFP_ADC_CH1               NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_ADC_CH1)
#define PB1MFP_ADC0_CH1              NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_ADC0_CH1)
#define PB1MFP_EBI_ADR8              NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_EBI_ADR8)
#define PB1MFP_UART2_TXD             NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_UART2_TXD)
#define PB1MFP_USCI1_CLK             NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_USCI1_CLK)
#define PB1MFP_I2C1_SCL              NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_I2C1_SCL)
#define PB1MFP_QSPI0_MISO1           NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_QSPI0_MISO1)
#define PB1MFP_PWM0_CH4              NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_PWM0_CH4)
#define PB1MFP_PWM1_CH4              NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_PWM1_CH4)
#define PB1MFP_PWM0_BRAKE0           NVT_PINMUX('B', 1, SYS_GPB_MFPL_PB1MFP_PWM0_BRAKE0)
#define PB2MFP_GPIO                  NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_GPIO)
#define PB2MFP_ADC_CH2               NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_ADC_CH2)
#define PB2MFP_ADC0_CH2              NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_ADC0_CH2)
#define PB2MFP_ACMP0_P1              NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_ACMP0_P1)
#define PB2MFP_EBI_ADR3              NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_EBI_ADR3)
#define PB2MFP_I2C1_SDA              NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_I2C1_SDA)
#define PB2MFP_UART1_RXD             NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_UART1_RXD)
#define PB2MFP_UART5_nCTS            NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_UART5_nCTS)
#define PB2MFP_USCI1_DAT0            NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_USCI1_DAT0)
#define PB2MFP_PWM0_CH3              NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_PWM0_CH3)
#define PB2MFP_TM3                   NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_TM3)
#define PB2MFP_INT3                  NVT_PINMUX('B', 2, SYS_GPB_MFPL_PB2MFP_INT3)
#define PB3MFP_GPIO                  NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_GPIO)
#define PB3MFP_ADC_CH3               NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_ADC_CH3)
#define PB3MFP_ADC0_CH3              NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_ADC0_CH3)
#define PB3MFP_ACMP0_N               NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_ACMP0_N)
#define PB3MFP_EBI_ADR2              NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_EBI_ADR2)
#define PB3MFP_I2C1_SCL              NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_I2C1_SCL)
#define PB3MFP_UART1_TXD             NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_UART1_TXD)
#define PB3MFP_UART5_nRTS            NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_UART5_nRTS)
#define PB3MFP_USCI1_DAT1            NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_USCI1_DAT1)
#define PB3MFP_PWM0_CH2              NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_PWM0_CH2)
#define PB3MFP_PWM0_BRAKE0           NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_PWM0_BRAKE0)
#define PB3MFP_TM2                   NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_TM2)
#define PB3MFP_INT2                  NVT_PINMUX('B', 3, SYS_GPB_MFPL_PB3MFP_INT2)
#define PB4MFP_GPIO                  NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_GPIO)
#define PB4MFP_ADC_CH4               NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_ADC_CH4)
#define PB4MFP_ADC0_CH4              NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_ADC0_CH4)
#define PB4MFP_ACMP1_P1              NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_ACMP1_P1)
#define PB4MFP_EBI_ADR1              NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_EBI_ADR1)
#define PB4MFP_I2C0_SDA              NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_I2C0_SDA)
#define PB4MFP_UART5_RXD             NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_UART5_RXD)
#define PB4MFP_USCI1_CTL1            NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_USCI1_CTL1)
#define PB4MFP_PWM0_CH1              NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_PWM0_CH1)
#define PB4MFP_UART2_RXD             NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_UART2_RXD)
#define PB4MFP_TM1                   NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_TM1)
#define PB4MFP_INT1                  NVT_PINMUX('B', 4, SYS_GPB_MFPL_PB4MFP_INT1)
#define PB5MFP_GPIO                  NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_GPIO)
#define PB5MFP_ADC_CH5               NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_ADC_CH5)
#define PB5MFP_ADC0_CH5              NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_ADC0_CH5)
#define PB5MFP_ACMP1_N               NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_ACMP1_N)
#define PB5MFP_EBI_ADR0              NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_EBI_ADR0)
#define PB5MFP_I2C0_SCL              NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_I2C0_SCL)
#define PB5MFP_UART5_TXD             NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_UART5_TXD)
#define PB5MFP_USCI1_CTL0            NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_USCI1_CTL0)
#define PB5MFP_PWM0_CH0              NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_PWM0_CH0)
#define PB5MFP_UART2_TXD             NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_UART2_TXD)
#define PB5MFP_TM0                   NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_TM0)
#define PB5MFP_INT0                  NVT_PINMUX('B', 5, SYS_GPB_MFPL_PB5MFP_INT0)
#define PB6MFP_GPIO                  NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_GPIO)
#define PB6MFP_ADC_CH6               NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_ADC_CH6)
#define PB6MFP_ADC0_CH6              NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_ADC0_CH6)
#define PB6MFP_EBI_nWRH              NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_EBI_nWRH)
#define PB6MFP_USCI1_DAT1            NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_USCI1_DAT1)
#define PB6MFP_UART1_RXD             NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_UART1_RXD)
#define PB6MFP_EBI_nCS1              NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_EBI_nCS1)
#define PB6MFP_BPWM1_CH5             NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_BPWM1_CH5)
#define PB6MFP_PWM1_BRAKE1           NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_PWM1_BRAKE1)
#define PB6MFP_PWM1_CH5              NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_PWM1_CH5)
#define PB6MFP_INT4                  NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_INT4)
#define PB6MFP_ACMP1_O               NVT_PINMUX('B', 6, SYS_GPB_MFPL_PB6MFP_ACMP1_O)
#define PB7MFP_GPIO                  NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_GPIO)
#define PB7MFP_ADC_CH7               NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_ADC_CH7)
#define PB7MFP_ADC0_CH7              NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_ADC0_CH7)
#define PB7MFP_EBI_nWRL              NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_EBI_nWRL)
#define PB7MFP_USCI1_DAT0            NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_USCI1_DAT0)
#define PB7MFP_UART1_TXD             NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_UART1_TXD)
#define PB7MFP_EBI_nCS0              NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_EBI_nCS0)
#define PB7MFP_BPWM1_CH4             NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_BPWM1_CH4)
#define PB7MFP_PWM1_BRAKE0           NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_PWM1_BRAKE0)
#define PB7MFP_PWM1_CH4              NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_PWM1_CH4)
#define PB7MFP_INT5                  NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_INT5)
#define PB7MFP_ACMP0_O               NVT_PINMUX('B', 7, SYS_GPB_MFPL_PB7MFP_ACMP0_O)
#define PB8MFP_GPIO                  NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_GPIO)
#define PB8MFP_ADC_CH8               NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_ADC_CH8)
#define PB8MFP_ADC0_CH8              NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_ADC0_CH8)
#define PB8MFP_EBI_ADR19             NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_EBI_ADR19)
#define PB8MFP_USCI1_CLK             NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_USCI1_CLK)
#define PB8MFP_UART0_RXD             NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_UART0_RXD)
#define PB8MFP_UART1_nRTS            NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_UART1_nRTS)
#define PB8MFP_UART7_RXD             NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_UART7_RXD)
#define PB8MFP_BPWM1_CH3             NVT_PINMUX('B', 8, SYS_GPB_MFPH_PB8MFP_BPWM1_CH3)
#define PB9MFP_GPIO                  NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_GPIO)
#define PB9MFP_ADC_CH9               NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_ADC_CH9)
#define PB9MFP_ADC0_CH9              NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_ADC0_CH9)
#define PB9MFP_EBI_ADR18             NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_EBI_ADR18)
#define PB9MFP_USCI1_CTL1            NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_USCI1_CTL1)
#define PB9MFP_UART0_TXD             NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_UART0_TXD)
#define PB9MFP_UART1_nCTS            NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_UART1_nCTS)
#define PB9MFP_UART7_TXD             NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_UART7_TXD)
#define PB9MFP_BPWM1_CH2             NVT_PINMUX('B', 9, SYS_GPB_MFPH_PB9MFP_BPWM1_CH2)
#define PB10MFP_GPIO                 NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_GPIO)
#define PB10MFP_ADC_CH10             NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_ADC_CH10)
#define PB10MFP_ADC0_CH10            NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_ADC0_CH10)
#define PB10MFP_EBI_ADR17            NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_EBI_ADR17)
#define PB10MFP_USCI1_CTL0           NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_USCI1_CTL0)
#define PB10MFP_UART0_nRTS           NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_UART0_nRTS)
#define PB10MFP_UART4_RXD            NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_UART4_RXD)
#define PB10MFP_I2C1_SDA             NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_I2C1_SDA)
#define PB10MFP_BPWM1_CH1            NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_BPWM1_CH1)
#define PB11MFP_GPIO                 NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_GPIO)
#define PB11MFP_ADC_CH11             NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_ADC_CH11)
#define PB11MFP_ADC0_CH11            NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_ADC0_CH11)
#define PB11MFP_EBI_ADR16            NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_EBI_ADR16)
#define PB11MFP_UART0_nCTS           NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_UART0_nCTS)
#define PB11MFP_UART4_TXD            NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_UART4_TXD)
#define PB11MFP_I2C1_SCL             NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_I2C1_SCL)
#define PB11MFP_SPI0_I2SMCLK         NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_SPI0_I2SMCLK)
#define PB11MFP_BPWM1_CH0            NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_BPWM1_CH0)
#define PB12MFP_GPIO                 NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_GPIO)
#define PB12MFP_ADC_CH12             NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ADC_CH12)
#define PB12MFP_ADC0_CH12            NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ADC0_CH12)
#define PB12MFP_ACMP0_P2             NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ACMP0_P2)
#define PB12MFP_ACMP1_P2             NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ACMP1_P2)
#define PB12MFP_EBI_AD15             NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EBI_AD15)
#define PB12MFP_SPI0_MOSI            NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_SPI0_MOSI)
#define PB12MFP_USCI0_CLK            NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_USCI0_CLK)
#define PB12MFP_UART0_RXD            NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_UART0_RXD)
#define PB12MFP_UART3_nCTS           NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_UART3_nCTS)
#define PB12MFP_PWM1_CH3             NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_PWM1_CH3)
#define PB12MFP_BPWM0_CH0            NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_BPWM0_CH0)
#define PB12MFP_TM3_EXT              NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_TM3_EXT)
#define PB13MFP_GPIO                 NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_GPIO)
#define PB13MFP_ADC_CH13             NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ADC_CH13)
#define PB13MFP_ADC0_CH13            NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ADC0_CH13)
#define PB13MFP_ACMP0_P3             NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ACMP0_P3)
#define PB13MFP_ACMP1_P3             NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ACMP1_P3)
#define PB13MFP_EBI_AD14             NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EBI_AD14)
#define PB13MFP_SPI0_MISO            NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_SPI0_MISO)
#define PB13MFP_USCI0_DAT0           NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_USCI0_DAT0)
#define PB13MFP_UART0_TXD            NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_UART0_TXD)
#define PB13MFP_UART3_nRTS           NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_UART3_nRTS)
#define PB13MFP_PWM1_CH2             NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_PWM1_CH2)
#define PB13MFP_BPWM0_CH1            NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_BPWM0_CH1)
#define PB13MFP_TM2_EXT              NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_TM2_EXT)
#define PB14MFP_GPIO                 NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_GPIO)
#define PB14MFP_ADC_CH14             NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_ADC_CH14)
