cyliangtw/hal_nuvoton/dts/pinctrl/m031-pinctrl.h
#define PB14MFP_ADC0_CH14            NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_ADC0_CH14)
#define PB14MFP_EBI_AD13             NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EBI_AD13)
#define PB14MFP_SPI0_CLK             NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_SPI0_CLK)
#define PB14MFP_USCI0_DAT1           NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_USCI0_DAT1)
#define PB14MFP_UART0_nRTS           NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_UART0_nRTS)
#define PB14MFP_UART3_RXD            NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_UART3_RXD)
#define PB14MFP_BPWM1_CH5            NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_BPWM1_CH5)
#define PB14MFP_PWM1_CH1             NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_PWM1_CH1)
#define PB14MFP_BPWM0_CH2            NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_BPWM0_CH2)
#define PB14MFP_TM1_EXT              NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_TM1_EXT)
#define PB14MFP_CLKO                 NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_CLKO)
#define PB15MFP_GPIO                 NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_GPIO)
#define PB15MFP_ADC_CH15             NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_ADC_CH15)
#define PB15MFP_ADC0_CH15            NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_ADC0_CH15)
#define PB15MFP_EBI_AD12             NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_EBI_AD12)
#define PB15MFP_SPI0_SS              NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_SPI0_SS)
#define PB15MFP_USCI0_CTL1           NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_USCI0_CTL1)
#define PB15MFP_UART0_nCTS           NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_UART0_nCTS)
#define PB15MFP_UART3_TXD            NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_UART3_TXD)
#define PB15MFP_BPWM1_CH4            NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_BPWM1_CH4)
#define PB15MFP_PWM1_CH0             NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_PWM1_CH0)
#define PB15MFP_BPWM0_CH3            NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_BPWM0_CH3)
#define PB15MFP_TM0_EXT              NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_TM0_EXT)
#define PB15MFP_PWM0_BRAKE1          NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_PWM0_BRAKE1)
#define PC0MFP_GPIO                  NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_GPIO)
#define PC0MFP_EBI_AD0               NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_EBI_AD0)
#define PC0MFP_QSPI0_MOSI0           NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_QSPI0_MOSI0)
#define PC0MFP_UART2_RXD             NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_UART2_RXD)
#define PC0MFP_I2C0_SDA              NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_I2C0_SDA)
#define PC0MFP_BPWM1_CH3             NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_BPWM1_CH3)
#define PC0MFP_PWM1_CH5              NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_PWM1_CH5)
#define PC0MFP_BPWM0_CH4             NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_BPWM0_CH4)
#define PC0MFP_ACMP1_O               NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_ACMP1_O)
#define PC1MFP_GPIO                  NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_GPIO)
#define PC1MFP_EBI_AD1               NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_EBI_AD1)
#define PC1MFP_QSPI0_MISO0           NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_QSPI0_MISO0)
#define PC1MFP_UART2_TXD             NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_UART2_TXD)
#define PC1MFP_I2C0_SCL              NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_I2C0_SCL)
#define PC1MFP_BPWM1_CH2             NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_BPWM1_CH2)
#define PC1MFP_PWM1_CH4              NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_PWM1_CH4)
#define PC1MFP_BPWM0_CH5             NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_BPWM0_CH5)
#define PC1MFP_ACMP0_O               NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_ACMP0_O)
#define PC1MFP_ADC_ST                NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_ADC_ST)
#define PC1MFP_ADC0_ST               NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_ADC0_ST)
#define PC2MFP_GPIO                  NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_GPIO)
#define PC2MFP_EBI_AD2               NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_EBI_AD2)
#define PC2MFP_QSPI0_CLK             NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_QSPI0_CLK)
#define PC2MFP_UART2_nCTS            NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_UART2_nCTS)
#define PC2MFP_I2C0_SMBSUS           NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_I2C0_SMBSUS)
#define PC2MFP_UART3_RXD             NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_UART3_RXD)
#define PC2MFP_PWM1_CH3              NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_PWM1_CH3)
#define PC3MFP_GPIO                  NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_GPIO)
#define PC3MFP_EBI_AD3               NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_EBI_AD3)
#define PC3MFP_QSPI0_SS              NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_QSPI0_SS)
#define PC3MFP_UART2_nRTS            NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_UART2_nRTS)
#define PC3MFP_I2C0_SMBAL            NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_I2C0_SMBAL)
#define PC3MFP_UART3_TXD             NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_UART3_TXD)
#define PC3MFP_PWM1_CH2              NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_PWM1_CH2)
#define PC4MFP_GPIO                  NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_GPIO)
#define PC4MFP_EBI_AD4               NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_EBI_AD4)
#define PC4MFP_QSPI0_MOSI1           NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_QSPI0_MOSI1)
#define PC4MFP_UART2_RXD             NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_UART2_RXD)
#define PC4MFP_I2C1_SDA              NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_I2C1_SDA)
#define PC4MFP_UART4_RXD             NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_UART4_RXD)
#define PC4MFP_PWM1_CH1              NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_PWM1_CH1)
#define PC5MFP_GPIO                  NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_GPIO)
#define PC5MFP_EBI_AD5               NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_EBI_AD5)
#define PC5MFP_QSPI0_MISO1           NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_QSPI0_MISO1)
#define PC5MFP_UART2_TXD             NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_UART2_TXD)
#define PC5MFP_I2C1_SCL              NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_I2C1_SCL)
#define PC5MFP_UART4_TXD             NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_UART4_TXD)
#define PC5MFP_PWM1_CH0              NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_PWM1_CH0)
#define PC6MFP_GPIO                  NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_GPIO)
#define PC6MFP_EBI_AD8               NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_EBI_AD8)
#define PC6MFP_UART4_RXD             NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_UART4_RXD)
#define PC6MFP_UART0_nRTS            NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_UART0_nRTS)
#define PC6MFP_UART6_RXD             NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_UART6_RXD)
#define PC6MFP_PWM1_CH3              NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_PWM1_CH3)
#define PC6MFP_BPWM1_CH1             NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_BPWM1_CH1)
#define PC6MFP_TM1                   NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_TM1)
#define PC6MFP_INT2                  NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_INT2)
#define PC7MFP_GPIO                  NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_GPIO)
#define PC7MFP_EBI_AD9               NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_EBI_AD9)
#define PC7MFP_UART4_TXD             NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_UART4_TXD)
#define PC7MFP_UART0_nCTS            NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_UART0_nCTS)
#define PC7MFP_UART6_TXD             NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_UART6_TXD)
#define PC7MFP_PWM1_CH2              NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_PWM1_CH2)
#define PC7MFP_BPWM1_CH0             NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_BPWM1_CH0)
#define PC7MFP_TM0                   NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_TM0)
#define PC7MFP_INT3                  NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_INT3)
#define PC8MFP_GPIO                  NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_GPIO)
#define PC8MFP_EBI_ADR16             NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_EBI_ADR16)
#define PC8MFP_I2C0_SDA              NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_I2C0_SDA)
#define PC8MFP_UART4_nCTS            NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_UART4_nCTS)
#define PC8MFP_UART1_RXD             NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_UART1_RXD)
#define PC8MFP_PWM1_CH1              NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_PWM1_CH1)
#define PC8MFP_BPWM1_CH4             NVT_PINMUX('C', 8, SYS_GPC_MFPH_PC8MFP_BPWM1_CH4)
#define PC9MFP_GPIO                  NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_GPIO)
#define PC9MFP_EBI_ADR7              NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_EBI_ADR7)
#define PC9MFP_UART6_nCTS            NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_UART6_nCTS)
#define PC9MFP_UART3_RXD             NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_UART3_RXD)
#define PC9MFP_PWM1_CH3              NVT_PINMUX('C', 9, SYS_GPC_MFPH_PC9MFP_PWM1_CH3)
#define PC10MFP_GPIO                 NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_GPIO)
#define PC10MFP_EBI_ADR6             NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_EBI_ADR6)
#define PC10MFP_UART6_nRTS           NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_UART6_nRTS)
#define PC10MFP_UART3_TXD            NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_UART3_TXD)
#define PC10MFP_PWM1_CH2             NVT_PINMUX('C', 10, SYS_GPC_MFPH_PC10MFP_PWM1_CH2)
#define PC11MFP_GPIO                 NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_GPIO)
#define PC11MFP_EBI_ADR5             NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_EBI_ADR5)
#define PC11MFP_UART0_RXD            NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_UART0_RXD)
#define PC11MFP_I2C0_SDA             NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_I2C0_SDA)
#define PC11MFP_UART6_RXD            NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_UART6_RXD)
#define PC11MFP_PWM1_CH1             NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_PWM1_CH1)
#define PC11MFP_ACMP1_O              NVT_PINMUX('C', 11, SYS_GPC_MFPH_PC11MFP_ACMP1_O)
#define PC12MFP_GPIO                 NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_GPIO)
#define PC12MFP_EBI_ADR4             NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_EBI_ADR4)
#define PC12MFP_UART0_TXD            NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_UART0_TXD)
#define PC12MFP_I2C0_SCL             NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_I2C0_SCL)
#define PC12MFP_UART6_TXD            NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_UART6_TXD)
#define PC12MFP_PWM1_CH0             NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_PWM1_CH0)
#define PC12MFP_ACMP0_O              NVT_PINMUX('C', 12, SYS_GPC_MFPH_PC12MFP_ACMP0_O)
#define PC13MFP_GPIO                 NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_GPIO)
#define PC13MFP_EBI_ADR10            NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_EBI_ADR10)
#define PC13MFP_USCI0_CTL0           NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_USCI0_CTL0)
#define PC13MFP_UART2_TXD            NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_UART2_TXD)
#define PC13MFP_BPWM0_CH4            NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_BPWM0_CH4)
#define PC13MFP_CLKO                 NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_CLKO)
#define PC13MFP_ADC_ST               NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_ADC_ST)
#define PC13MFP_ADC0_ST              NVT_PINMUX('C', 13, SYS_GPC_MFPH_PC13MFP_ADC0_ST)
#define PC14MFP_GPIO                 NVT_PINMUX('C', 14, SYS_GPC_MFPH_PC14MFP_GPIO)
#define PC14MFP_EBI_AD11             NVT_PINMUX('C', 14, SYS_GPC_MFPH_PC14MFP_EBI_AD11)
#define PC14MFP_SPI0_I2SMCLK         NVT_PINMUX('C', 14, SYS_GPC_MFPH_PC14MFP_SPI0_I2SMCLK)
#define PC14MFP_USCI0_CTL0           NVT_PINMUX('C', 14, SYS_GPC_MFPH_PC14MFP_USCI0_CTL0)
#define PC14MFP_QSPI0_CLK            NVT_PINMUX('C', 14, SYS_GPC_MFPH_PC14MFP_QSPI0_CLK)
#define PC14MFP_TM1                  NVT_PINMUX('C', 14, SYS_GPC_MFPH_PC14MFP_TM1)
#define PD0MFP_GPIO                  NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_GPIO)
#define PD0MFP_EBI_AD13              NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_EBI_AD13)
#define PD0MFP_USCI0_CLK             NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_USCI0_CLK)
#define PD0MFP_SPI0_MOSI             NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_SPI0_MOSI)
#define PD0MFP_UART3_RXD             NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_UART3_RXD)
#define PD0MFP_TM2                   NVT_PINMUX('D', 0, SYS_GPD_MFPL_PD0MFP_TM2)
#define PD1MFP_GPIO                  NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_GPIO)
#define PD1MFP_EBI_AD12              NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_EBI_AD12)
#define PD1MFP_USCI0_DAT0            NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_USCI0_DAT0)
#define PD1MFP_SPI0_MISO             NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_SPI0_MISO)
#define PD1MFP_UART3_TXD             NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_UART3_TXD)
#define PD2MFP_GPIO                  NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_GPIO)
#define PD2MFP_EBI_AD11              NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_EBI_AD11)
#define PD2MFP_USCI0_DAT1            NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_USCI0_DAT1)
#define PD2MFP_SPI0_CLK              NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_SPI0_CLK)
#define PD2MFP_UART3_nCTS            NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_UART3_nCTS)
#define PD2MFP_UART0_RXD             NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_UART0_RXD)
#define PD3MFP_GPIO                  NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_GPIO)
#define PD3MFP_EBI_AD10              NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_EBI_AD10)
#define PD3MFP_USCI0_CTL1            NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_USCI0_CTL1)
#define PD3MFP_SPI0_SS               NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_SPI0_SS)
#define PD3MFP_UART3_nRTS            NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_UART3_nRTS)
#define PD3MFP_USCI1_CTL0            NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_USCI1_CTL0)
#define PD3MFP_UART0_TXD             NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_UART0_TXD)
#define PD4MFP_GPIO                  NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_GPIO)
#define PD4MFP_USCI0_CTL0            NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_USCI0_CTL0)
#define PD4MFP_I2C1_SDA              NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_I2C1_SDA)
#define PD4MFP_USCI1_CTL1            NVT_PINMUX('D', 4, SYS_GPD_MFPL_PD4MFP_USCI1_CTL1)
#define PD5MFP_GPIO                  NVT_PINMUX('D', 5, SYS_GPD_MFPL_PD5MFP_GPIO)
#define PD5MFP_I2C1_SCL              NVT_PINMUX('D', 5, SYS_GPD_MFPL_PD5MFP_I2C1_SCL)
#define PD5MFP_USCI1_DAT0            NVT_PINMUX('D', 5, SYS_GPD_MFPL_PD5MFP_USCI1_DAT0)
#define PD6MFP_GPIO                  NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_GPIO)
#define PD6MFP_UART1_RXD             NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_UART1_RXD)
#define PD6MFP_I2C0_SDA              NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_I2C0_SDA)
#define PD6MFP_USCI1_DAT1            NVT_PINMUX('D', 6, SYS_GPD_MFPL_PD6MFP_USCI1_DAT1)
#define PD7MFP_GPIO                  NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_GPIO)
#define PD7MFP_UART1_TXD             NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_UART1_TXD)
#define PD7MFP_I2C0_SCL              NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_I2C0_SCL)
#define PD7MFP_USCI1_CLK             NVT_PINMUX('D', 7, SYS_GPD_MFPL_PD7MFP_USCI1_CLK)
#define PD8MFP_GPIO                  NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_GPIO)
#define PD8MFP_EBI_AD6               NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_EBI_AD6)
#define PD8MFP_UART2_nRTS            NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_UART2_nRTS)
#define PD8MFP_UART7_RXD             NVT_PINMUX('D', 8, SYS_GPD_MFPH_PD8MFP_UART7_RXD)
#define PD9MFP_GPIO                  NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_GPIO)
#define PD9MFP_EBI_AD7               NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_EBI_AD7)
#define PD9MFP_UART2_nCTS            NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_UART2_nCTS)
#define PD9MFP_UART7_TXD             NVT_PINMUX('D', 9, SYS_GPD_MFPH_PD9MFP_UART7_TXD)
#define PD10MFP_GPIO                 NVT_PINMUX('D', 10, SYS_GPD_MFPH_PD10MFP_GPIO)
#define PD10MFP_EBI_nCS2             NVT_PINMUX('D', 10, SYS_GPD_MFPH_PD10MFP_EBI_nCS2)
#define PD10MFP_UART1_RXD            NVT_PINMUX('D', 10, SYS_GPD_MFPH_PD10MFP_UART1_RXD)
#define PD11MFP_GPIO                 NVT_PINMUX('D', 11, SYS_GPD_MFPH_PD11MFP_GPIO)
#define PD11MFP_EBI_nCS1             NVT_PINMUX('D', 11, SYS_GPD_MFPH_PD11MFP_EBI_nCS1)
#define PD11MFP_UART1_TXD            NVT_PINMUX('D', 11, SYS_GPD_MFPH_PD11MFP_UART1_TXD)
#define PD12MFP_GPIO                 NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_GPIO)
#define PD12MFP_EBI_nCS0             NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_EBI_nCS0)
#define PD12MFP_UART2_RXD            NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_UART2_RXD)
#define PD12MFP_BPWM0_CH5            NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_BPWM0_CH5)
#define PD12MFP_CLKO                 NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_CLKO)
#define PD12MFP_ADC_ST               NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_ADC_ST)
#define PD12MFP_ADC0_ST              NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_ADC0_ST)
#define PD12MFP_INT5                 NVT_PINMUX('D', 12, SYS_GPD_MFPH_PD12MFP_INT5)
#define PD13MFP_GPIO                 NVT_PINMUX('D', 13, SYS_GPD_MFPH_PD13MFP_GPIO)
#define PD13MFP_EBI_AD10             NVT_PINMUX('D', 13, SYS_GPD_MFPH_PD13MFP_EBI_AD10)
#define PD13MFP_SPI0_I2SMCLK         NVT_PINMUX('D', 13, SYS_GPD_MFPH_PD13MFP_SPI0_I2SMCLK)
#define PD14MFP_GPIO                 NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_GPIO)
#define PD14MFP_EBI_nCS0             NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_EBI_nCS0)
#define PD14MFP_SPI0_I2SMCLK         NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_SPI0_I2SMCLK)
#define PD14MFP_USCI0_CTL0           NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_USCI0_CTL0)
#define PD14MFP_PWM0_CH4             NVT_PINMUX('D', 14, SYS_GPD_MFPH_PD14MFP_PWM0_CH4)
#define PD15MFP_GPIO                 NVT_PINMUX('D', 15, SYS_GPD_MFPH_PD15MFP_GPIO)
#define PD15MFP_PWM0_CH5             NVT_PINMUX('D', 15, SYS_GPD_MFPH_PD15MFP_PWM0_CH5)
#define PD15MFP_TM3                  NVT_PINMUX('D', 15, SYS_GPD_MFPH_PD15MFP_TM3)
#define PD15MFP_INT1                 NVT_PINMUX('D', 15, SYS_GPD_MFPH_PD15MFP_INT1)
#define PE0MFP_GPIO                  NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_GPIO)
#define PE0MFP_EBI_AD11              NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_EBI_AD11)
#define PE0MFP_QSPI0_MOSI0           NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_QSPI0_MOSI0)
#define PE0MFP_UART3_RXD             NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_UART3_RXD)
#define PE0MFP_I2C1_SDA              NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_I2C1_SDA)
#define PE0MFP_UART4_nRTS            NVT_PINMUX('E', 0, SYS_GPE_MFPL_PE0MFP_UART4_nRTS)
#define PE1MFP_GPIO                  NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_GPIO)
#define PE1MFP_EBI_AD10              NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_EBI_AD10)
#define PE1MFP_QSPI0_MISO0           NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_QSPI0_MISO0)
#define PE1MFP_UART3_TXD             NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_UART3_TXD)
#define PE1MFP_I2C1_SCL              NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_I2C1_SCL)
#define PE1MFP_UART4_nCTS            NVT_PINMUX('E', 1, SYS_GPE_MFPL_PE1MFP_UART4_nCTS)
#define PE2MFP_GPIO                  NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_GPIO)
#define PE2MFP_EBI_ALE               NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_EBI_ALE)
#define PE2MFP_USCI0_CLK             NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_USCI0_CLK)
#define PE2MFP_UART6_nCTS            NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_UART6_nCTS)
#define PE2MFP_UART7_RXD             NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_UART7_RXD)
#define PE2MFP_PWM0_CH5              NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_PWM0_CH5)
#define PE2MFP_BPWM0_CH0             NVT_PINMUX('E', 2, SYS_GPE_MFPL_PE2MFP_BPWM0_CH0)
#define PE3MFP_GPIO                  NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_GPIO)
#define PE3MFP_EBI_MCLK              NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_EBI_MCLK)
#define PE3MFP_USCI0_DAT0            NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_USCI0_DAT0)
#define PE3MFP_UART6_nRTS            NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_UART6_nRTS)
#define PE3MFP_UART7_TXD             NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_UART7_TXD)
#define PE3MFP_PWM0_CH4              NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_PWM0_CH4)
#define PE3MFP_BPWM0_CH1             NVT_PINMUX('E', 3, SYS_GPE_MFPL_PE3MFP_BPWM0_CH1)
#define PE4MFP_GPIO                  NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_GPIO)
#define PE4MFP_EBI_nWR               NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_EBI_nWR)
#define PE4MFP_USCI0_DAT1            NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_USCI0_DAT1)
#define PE4MFP_UART6_RXD             NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_UART6_RXD)
#define PE4MFP_UART7_nCTS            NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_UART7_nCTS)
#define PE4MFP_PWM0_CH3              NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_PWM0_CH3)
#define PE4MFP_BPWM0_CH2             NVT_PINMUX('E', 4, SYS_GPE_MFPL_PE4MFP_BPWM0_CH2)
#define PE5MFP_GPIO                  NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_GPIO)
#define PE5MFP_EBI_nRD               NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_EBI_nRD)
#define PE5MFP_USCI0_CTL1            NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_USCI0_CTL1)
#define PE5MFP_UART6_TXD             NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_UART6_TXD)
#define PE5MFP_UART7_nRTS            NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_UART7_nRTS)
#define PE5MFP_PWM0_CH2              NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_PWM0_CH2)
#define PE5MFP_BPWM0_CH3             NVT_PINMUX('E', 5, SYS_GPE_MFPL_PE5MFP_BPWM0_CH3)
#define PE6MFP_GPIO                  NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_GPIO)
#define PE6MFP_USCI0_CTL0            NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_USCI0_CTL0)
#define PE6MFP_UART5_RXD             NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_UART5_RXD)
#define PE6MFP_PWM0_CH1              NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_PWM0_CH1)
#define PE6MFP_BPWM0_CH4             NVT_PINMUX('E', 6, SYS_GPE_MFPL_PE6MFP_BPWM0_CH4)
#define PE7MFP_GPIO                  NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_GPIO)
#define PE7MFP_UART5_TXD             NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_UART5_TXD)
#define PE7MFP_PWM0_CH0              NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_PWM0_CH0)
#define PE7MFP_BPWM0_CH5             NVT_PINMUX('E', 7, SYS_GPE_MFPL_PE7MFP_BPWM0_CH5)
#define PE8MFP_GPIO                  NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_GPIO)
#define PE8MFP_EBI_ADR10             NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_EBI_ADR10)
#define PE8MFP_USCI1_CTL1            NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_USCI1_CTL1)
#define PE8MFP_UART2_TXD             NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_UART2_TXD)
#define PE8MFP_PWM0_CH0              NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_PWM0_CH0)
#define PE8MFP_PWM0_BRAKE0           NVT_PINMUX('E', 8, SYS_GPE_MFPH_PE8MFP_PWM0_BRAKE0)
#define PE9MFP_GPIO                  NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_GPIO)
#define PE9MFP_EBI_ADR11             NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_EBI_ADR11)
#define PE9MFP_USCI1_CTL0            NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_USCI1_CTL0)
#define PE9MFP_UART2_RXD             NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_UART2_RXD)
#define PE9MFP_PWM0_CH1              NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_PWM0_CH1)
#define PE9MFP_PWM0_BRAKE1           NVT_PINMUX('E', 9, SYS_GPE_MFPH_PE9MFP_PWM0_BRAKE1)
#define PE10MFP_GPIO                 NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_GPIO)
#define PE10MFP_EBI_ADR12            NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_EBI_ADR12)
#define PE10MFP_USCI1_DAT0           NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_USCI1_DAT0)
#define PE10MFP_UART3_TXD            NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_UART3_TXD)
#define PE10MFP_PWM0_CH2             NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_PWM0_CH2)
#define PE10MFP_PWM1_BRAKE0          NVT_PINMUX('E', 10, SYS_GPE_MFPH_PE10MFP_PWM1_BRAKE0)
#define PE11MFP_GPIO                 NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_GPIO)
#define PE11MFP_EBI_ADR13            NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_EBI_ADR13)
