cyliangtw/hal_nuvoton/dts/pinctrl/m031-pinctrl.h
#define PE11MFP_USCI1_DAT1           NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_USCI1_DAT1)
#define PE11MFP_UART3_RXD            NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_UART3_RXD)
#define PE11MFP_UART1_nCTS           NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_UART1_nCTS)
#define PE11MFP_PWM0_CH3             NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_PWM0_CH3)
#define PE11MFP_PWM1_BRAKE1          NVT_PINMUX('E', 11, SYS_GPE_MFPH_PE11MFP_PWM1_BRAKE1)
#define PE12MFP_GPIO                 NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_GPIO)
#define PE12MFP_EBI_ADR14            NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_EBI_ADR14)
#define PE12MFP_USCI1_CLK            NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_USCI1_CLK)
#define PE12MFP_UART1_nRTS           NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_UART1_nRTS)
#define PE12MFP_PWM0_CH4             NVT_PINMUX('E', 12, SYS_GPE_MFPH_PE12MFP_PWM0_CH4)
#define PE13MFP_GPIO                 NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_GPIO)
#define PE13MFP_EBI_ADR15            NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_EBI_ADR15)
#define PE13MFP_I2C0_SCL             NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_I2C0_SCL)
#define PE13MFP_UART4_nRTS           NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_UART4_nRTS)
#define PE13MFP_UART1_TXD            NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_UART1_TXD)
#define PE13MFP_PWM0_CH5             NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_PWM0_CH5)
#define PE13MFP_PWM1_CH0             NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_PWM1_CH0)
#define PE13MFP_BPWM1_CH5            NVT_PINMUX('E', 13, SYS_GPE_MFPH_PE13MFP_BPWM1_CH5)
#define PE14MFP_GPIO                 NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_GPIO)
#define PE14MFP_EBI_AD8              NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_EBI_AD8)
#define PE14MFP_UART2_TXD            NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_UART2_TXD)
#define PE14MFP_UART6_TXD            NVT_PINMUX('E', 14, SYS_GPE_MFPH_PE14MFP_UART6_TXD)
#define PE15MFP_GPIO                 NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_GPIO)
#define PE15MFP_EBI_AD9              NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_EBI_AD9)
#define PE15MFP_UART2_RXD            NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_UART2_RXD)
#define PE15MFP_UART6_RXD            NVT_PINMUX('E', 15, SYS_GPE_MFPH_PE15MFP_UART6_RXD)
#define PF0MFP_GPIO                  NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_GPIO)
#define PF0MFP_UART1_TXD             NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_UART1_TXD)
#define PF0MFP_I2C1_SCL              NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_I2C1_SCL)
#define PF0MFP_UART0_TXD             NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_UART0_TXD)
#define PF0MFP_BPWM1_CH0             NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_BPWM1_CH0)
#define PF0MFP_BPWM0_CH5             NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_BPWM0_CH5)
#define PF0MFP_ICE_DAT               NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_ICE_DAT)
#define PF1MFP_GPIO                  NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_GPIO)
#define PF1MFP_UART1_RXD             NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_UART1_RXD)
#define PF1MFP_I2C1_SDA              NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_I2C1_SDA)
#define PF1MFP_UART0_RXD             NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_UART0_RXD)
#define PF1MFP_BPWM1_CH1             NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_BPWM1_CH1)
#define PF1MFP_BPWM0_CH4             NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_BPWM0_CH4)
#define PF1MFP_ICE_CLK               NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_ICE_CLK)
#define PF2MFP_GPIO                  NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_GPIO)
#define PF2MFP_EBI_nCS1              NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_EBI_nCS1)
#define PF2MFP_UART0_RXD             NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_UART0_RXD)
#define PF2MFP_I2C0_SDA              NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_I2C0_SDA)
#define PF2MFP_QSPI0_CLK             NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_QSPI0_CLK)
#define PF2MFP_XT1_OUT               NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_XT1_OUT)
#define PF2MFP_BPWM1_CH1             NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_BPWM1_CH1)
#define PF2MFP_USCI1_CTL1            NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_USCI1_CTL1)
#define PF3MFP_GPIO                  NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_GPIO)
#define PF3MFP_EBI_nCS0              NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_EBI_nCS0)
#define PF3MFP_UART0_TXD             NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_UART0_TXD)
#define PF3MFP_I2C0_SCL              NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_I2C0_SCL)
#define PF3MFP_XT1_IN                NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_XT1_IN)
#define PF3MFP_BPWM1_CH0             NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_BPWM1_CH0)
#define PF3MFP_USCI1_CTL0            NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_USCI1_CTL0)
#define PF4MFP_GPIO                  NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_GPIO)
#define PF4MFP_UART2_TXD             NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_UART2_TXD)
#define PF4MFP_QSPI0_MOSI1           NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_QSPI0_MOSI1)
#define PF4MFP_UART2_nRTS            NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_UART2_nRTS)
#define PF4MFP_PWM0_CH1              NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_PWM0_CH1)
#define PF4MFP_BPWM0_CH5             NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_BPWM0_CH5)
#define PF4MFP_X32_OUT               NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_X32_OUT)
#define PF5MFP_GPIO                  NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_GPIO)
#define PF5MFP_UART2_RXD             NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_UART2_RXD)
#define PF5MFP_QSPI0_MISO1           NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_QSPI0_MISO1)
#define PF5MFP_UART2_nCTS            NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_UART2_nCTS)
#define PF5MFP_PWM0_CH0              NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_PWM0_CH0)
#define PF5MFP_BPWM0_CH4             NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_BPWM0_CH4)
#define PF5MFP_X32_IN                NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_X32_IN)
#define PF5MFP_ADC_ST                NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_ADC_ST)
#define PF5MFP_ADC0_ST               NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_ADC0_ST)
#define PF6MFP_GPIO                  NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_GPIO)
#define PF6MFP_EBI_ADR19             NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_EBI_ADR19)
#define PF6MFP_SPI0_MOSI             NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_SPI0_MOSI)
#define PF6MFP_UART4_RXD             NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_UART4_RXD)
#define PF6MFP_EBI_nCS0              NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_EBI_nCS0)
#define PF7MFP_GPIO                  NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_GPIO)
#define PF7MFP_EBI_ADR18             NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_EBI_ADR18)
#define PF7MFP_SPI0_MISO             NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_SPI0_MISO)
#define PF7MFP_UART4_TXD             NVT_PINMUX('F', 7, SYS_GPF_MFPL_PF7MFP_UART4_TXD)
#define PF8MFP_GPIO                  NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_GPIO)
#define PF8MFP_EBI_ADR17             NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_EBI_ADR17)
#define PF8MFP_SPI0_CLK              NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_SPI0_CLK)
#define PF8MFP_UART5_nCTS            NVT_PINMUX('F', 8, SYS_GPF_MFPH_PF8MFP_UART5_nCTS)
#define PF9MFP_GPIO                  NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_GPIO)
#define PF9MFP_EBI_ADR16             NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_EBI_ADR16)
#define PF9MFP_SPI0_SS               NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_SPI0_SS)
#define PF9MFP_UART5_nRTS            NVT_PINMUX('F', 9, SYS_GPF_MFPH_PF9MFP_UART5_nRTS)
#define PF10MFP_GPIO                 NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_GPIO)
#define PF10MFP_EBI_ADR15            NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_EBI_ADR15)
#define PF10MFP_SPI0_I2SMCLK         NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_SPI0_I2SMCLK)
#define PF10MFP_UART5_RXD            NVT_PINMUX('F', 10, SYS_GPF_MFPH_PF10MFP_UART5_RXD)
#define PF11MFP_GPIO                 NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_GPIO)
#define PF11MFP_EBI_ADR14            NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_EBI_ADR14)
#define PF11MFP_UART5_TXD            NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_UART5_TXD)
#define PF11MFP_TM3                  NVT_PINMUX('F', 11, SYS_GPF_MFPH_PF11MFP_TM3)
#define PF14MFP_GPIO                 NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_GPIO)
#define PF14MFP_PWM1_BRAKE0          NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_PWM1_BRAKE0)
#define PF14MFP_PWM0_BRAKE0          NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_PWM0_BRAKE0)
#define PF14MFP_PWM0_CH4             NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_PWM0_CH4)
#define PF14MFP_CLKO                 NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_CLKO)
#define PF14MFP_TM3                  NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_TM3)
#define PF14MFP_INT5                 NVT_PINMUX('F', 14, SYS_GPF_MFPH_PF14MFP_INT5)
#define PF15MFP_GPIO                 NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_GPIO)
#define PF15MFP_PWM0_BRAKE0          NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_PWM0_BRAKE0)
#define PF15MFP_PWM0_CH1             NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_PWM0_CH1)
#define PF15MFP_TM2                  NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_TM2)
#define PF15MFP_CLKO                 NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_CLKO)
#define PF15MFP_INT4                 NVT_PINMUX('F', 15, SYS_GPF_MFPH_PF15MFP_INT4)
#define PG2MFP_GPIO                  NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_GPIO)
#define PG2MFP_EBI_ADR11             NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_EBI_ADR11)
#define PG2MFP_I2C0_SMBAL            NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_I2C0_SMBAL)
#define PG2MFP_I2C1_SCL              NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_I2C1_SCL)
#define PG2MFP_TM0                   NVT_PINMUX('G', 2, SYS_GPG_MFPL_PG2MFP_TM0)
#define PG3MFP_GPIO                  NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_GPIO)
#define PG3MFP_EBI_ADR12             NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_EBI_ADR12)
#define PG3MFP_I2C0_SMBSUS           NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_I2C0_SMBSUS)
#define PG3MFP_I2C1_SDA              NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_I2C1_SDA)
#define PG3MFP_TM1                   NVT_PINMUX('G', 3, SYS_GPG_MFPL_PG3MFP_TM1)
#define PG4MFP_GPIO                  NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_GPIO)
#define PG4MFP_EBI_ADR13             NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_EBI_ADR13)
#define PG4MFP_TM2                   NVT_PINMUX('G', 4, SYS_GPG_MFPL_PG4MFP_TM2)
#define PG9MFP_GPIO                  NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_GPIO)
#define PG9MFP_EBI_AD0               NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_EBI_AD0)
#define PG9MFP_BPWM0_CH5             NVT_PINMUX('G', 9, SYS_GPG_MFPH_PG9MFP_BPWM0_CH5)
#define PG10MFP_GPIO                 NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_GPIO)
#define PG10MFP_EBI_AD1              NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_EBI_AD1)
#define PG10MFP_BPWM0_CH4            NVT_PINMUX('G', 10, SYS_GPG_MFPH_PG10MFP_BPWM0_CH4)
#define PG11MFP_GPIO                 NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_GPIO)
#define PG11MFP_EBI_AD2              NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_EBI_AD2)
#define PG11MFP_UART7_TXD            NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_UART7_TXD)
#define PG11MFP_BPWM0_CH3            NVT_PINMUX('G', 11, SYS_GPG_MFPH_PG11MFP_BPWM0_CH3)
#define PG12MFP_GPIO                 NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_GPIO)
#define PG12MFP_EBI_AD3              NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_EBI_AD3)
#define PG12MFP_UART7_RXD            NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_UART7_RXD)
#define PG12MFP_BPWM0_CH2            NVT_PINMUX('G', 12, SYS_GPG_MFPH_PG12MFP_BPWM0_CH2)
#define PG13MFP_GPIO                 NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_GPIO)
#define PG13MFP_EBI_AD4              NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_EBI_AD4)
#define PG13MFP_UART6_TXD            NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_UART6_TXD)
#define PG13MFP_BPWM0_CH1            NVT_PINMUX('G', 13, SYS_GPG_MFPH_PG13MFP_BPWM0_CH1)
#define PG14MFP_GPIO                 NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_GPIO)
#define PG14MFP_EBI_AD5              NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_EBI_AD5)
#define PG14MFP_UART6_RXD            NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_UART6_RXD)
#define PG14MFP_BPWM0_CH0            NVT_PINMUX('G', 14, SYS_GPG_MFPH_PG14MFP_BPWM0_CH0)
#define PG15MFP_GPIO                 NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_GPIO)
#define PG15MFP_CLKO                 NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_CLKO)
#define PG15MFP_ADC_ST               NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_ADC_ST)
#define PG15MFP_ADC0_ST              NVT_PINMUX('G', 15, SYS_GPG_MFPH_PG15MFP_ADC0_ST)
#define PH4MFP_GPIO                  NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_GPIO)
#define PH4MFP_EBI_ADR3              NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_EBI_ADR3)
#define PH4MFP_UART7_nRTS            NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_UART7_nRTS)
#define PH4MFP_UART6_TXD             NVT_PINMUX('H', 4, SYS_GPH_MFPL_PH4MFP_UART6_TXD)
#define PH5MFP_GPIO                  NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_GPIO)
#define PH5MFP_EBI_ADR2              NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_EBI_ADR2)
#define PH5MFP_UART7_nCTS            NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_UART7_nCTS)
#define PH5MFP_UART6_RXD             NVT_PINMUX('H', 5, SYS_GPH_MFPL_PH5MFP_UART6_RXD)
#define PH6MFP_GPIO                  NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_GPIO)
#define PH6MFP_EBI_ADR1              NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_EBI_ADR1)
#define PH6MFP_UART7_TXD             NVT_PINMUX('H', 6, SYS_GPH_MFPL_PH6MFP_UART7_TXD)
#define PH7MFP_GPIO                  NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_GPIO)
#define PH7MFP_EBI_ADR0              NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_EBI_ADR0)
#define PH7MFP_UART7_RXD             NVT_PINMUX('H', 7, SYS_GPH_MFPL_PH7MFP_UART7_RXD)
#define PH8MFP_GPIO                  NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_GPIO)
#define PH8MFP_EBI_AD12              NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_EBI_AD12)
#define PH8MFP_QSPI0_CLK             NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_QSPI0_CLK)
#define PH8MFP_UART3_nRTS            NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_UART3_nRTS)
#define PH8MFP_UART1_TXD             NVT_PINMUX('H', 8, SYS_GPH_MFPH_PH8MFP_UART1_TXD)
#define PH9MFP_GPIO                  NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_GPIO)
#define PH9MFP_EBI_AD13              NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_EBI_AD13)
#define PH9MFP_QSPI0_SS              NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_QSPI0_SS)
#define PH9MFP_UART3_nCTS            NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_UART3_nCTS)
#define PH9MFP_UART1_RXD             NVT_PINMUX('H', 9, SYS_GPH_MFPH_PH9MFP_UART1_RXD)
#define PH10MFP_GPIO                 NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_GPIO)
#define PH10MFP_EBI_AD14             NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_EBI_AD14)
#define PH10MFP_QSPI0_MISO1          NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_QSPI0_MISO1)
#define PH10MFP_UART4_TXD            NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_UART4_TXD)
#define PH10MFP_UART0_TXD            NVT_PINMUX('H', 10, SYS_GPH_MFPH_PH10MFP_UART0_TXD)
#define PH11MFP_GPIO                 NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_GPIO)
#define PH11MFP_EBI_AD15             NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_EBI_AD15)
#define PH11MFP_QSPI0_MOSI1          NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_QSPI0_MOSI1)
#define PH11MFP_UART4_RXD            NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_UART4_RXD)
#define PH11MFP_UART0_RXD            NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_UART0_RXD)
#define PH11MFP_PWM0_CH5             NVT_PINMUX('H', 11, SYS_GPH_MFPH_PH11MFP_PWM0_CH5)
